workstation/tutorials/combustion/reactingFoam/RAS/membrane/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/0.orig/include"

defaultFieldValues
(
    volScalarFieldValue CH4 $:sleeve.CH4
    volScalarFieldValue N2 $:sleeve.N2
    volScalarFieldValue O2 $:sleeve.O2
);

regions
(
    zoneToCell
    {
        zone pipe;
        fieldValues
        (
            volScalarFieldValue CH4 $:pipe.CH4
            volScalarFieldValue N2 $:pipe.N2
            volScalarFieldValue O2 $:pipe.O2
        );
    }
);


// ************************************************************************* //
